Tekla.Structures.Geometry3d.Matrix.Transform(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Transforms the given points using the current matrix.
Points: The points to be transformed.
Returns: The new transformed points.

Tekla.Structures.Geometry3d.Matrix.op_Multiply(Tekla.Structures.Geometry3d.Matrix,System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})
Transforms the given points using the given matrix.
A: The transformation matrix.
Points: The points to be transformed.
Returns: The new transformed points.